cmsis-svd/cmsis-svd/data/STMicro/STM32WB35.svd
            <register>
               <name>RLR27</name>
               <displayName>RLR27</displayName>
               <description>Semaphore 27 read lock           register</description>
               <addressOffset>0xEC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore CoreID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLR28</name>
               <displayName>RLR28</displayName>
               <description>Semaphore 28 read lock           register</description>
               <addressOffset>0xF0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore CoreID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLR29</name>
               <displayName>RLR29</displayName>
               <description>Semaphore 29 read lock           register</description>
               <addressOffset>0xF4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore CoreID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLR30</name>
               <displayName>RLR30</displayName>
               <description>Semaphore 30 read lock           register</description>
               <addressOffset>0xF8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore CoreID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLR31</name>
               <displayName>RLR31</displayName>
               <description>Semaphore 31 read lock           register</description>
               <addressOffset>0xFC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore CoreID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Semaphore Clear register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Semaphore clear Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COREID</name>
                     <description>CoreID of semaphore to be               cleared</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR</name>
               <displayName>KEYR</displayName>
               <description>Interrupt clear register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Semaphore Clear Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR2</name>
               <displayName>HWCFGR2</displayName>
               <description>Semaphore hardware configuration register           2</description>
               <addressOffset>0x3EC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000084</resetValue>
               <fields>
                  <field>
                     <name>MASTERID4</name>
                     <description>Hardware Configuration valid bus masters               ID4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID3</name>
                     <description>Hardware Configuration valid bus masters               ID3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID2</name>
                     <description>Hardware Configuration valid bus masters               ID2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID1</name>
                     <description>Hardware Configuration valid bus masters               ID1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR1</name>
               <displayName>HWCFGR1</displayName>
               <description>Semaphore hardware configuration register           1</description>
               <addressOffset>0x3F0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000220</resetValue>
               <fields>
                  <field>
                     <name>NBINT</name>
                     <description>Hardware Configuration number of               interrupts supported number of master               IDs</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>NBSEM</name>
                     <description>Hardware Configuration number of               semaphores</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERR</name>
               <displayName>VERR</displayName>
               <description>HSEM version register</description>
               <addressOffset>0x3F4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000020</resetValue>
               <fields>
                  <field>
                     <name>MAJREV</name>
                     <description>Major Revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MINREV</name>
                     <description>Minor Revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPIDR</name>
               <displayName>IPIDR</displayName>
               <description>HSEM indentification register</description>
               <addressOffset>0x3F8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00100072</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Identification Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIDR</name>
               <displayName>SIDR</displayName>
               <description>HSEM size indentification           register</description>
               <addressOffset>0x3FC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0xA3C5DD01</resetValue>
               <fields>
                  <field>
                     <name>SID</name>
                     <description>Size Identification Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1IER0</name>
               <displayName>C1IER0</displayName>
               <description>HSEM Interrupt enable register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISEm</name>
                     <description>CPU(n) semaphore m enable               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1ICR</name>
               <displayName>C1ICR</displayName>
               <description>HSEM Interrupt clear register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISCm</name>
                     <description>CPU(n) semaphore m clear               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1ISR</name>
               <displayName>C1ISR</displayName>
               <description>HSEM Interrupt status register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISFm</name>
                     <description>CPU(n) semaphore m status bit before               enable (mask)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1MISR</name>
               <displayName>C1MISR</displayName>
               <description>HSEM Masked interrupt status           register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MISFm</name>
                     <description>masked CPU(n) semaphore m status bit               after enable (mask).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2IER0</name>
               <displayName>C2IER0</displayName>
               <description>HSEM Interrupt enable register</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISEm</name>
                     <description>CPU(2) semaphore m enable               bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2ICR</name>
               <displayName>C2ICR</displayName>
               <description>HSEM Interrupt clear register</description>
               <addressOffset>0x114</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISCm</name>
                     <description>CPU(2) semaphore m clear               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2ISR</name>
               <displayName>C2ISR</displayName>
               <description>HSEM Interrupt status register</description>
               <addressOffset>0x118</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISFm</name>
                     <description>CPU(2) semaphore m status bit before               enable (mask).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2MISR</name>
               <displayName>C2MISR</displayName>
               <description>HSEM Masked interrupt status           register</description>
               <addressOffset>0x11C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MISFm</name>
                     <description>masked CPU(2) semaphore m status bit               after enable (mask).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
