cmsis-svd/cmsis-svd/data/STMicro/STM32WB35.svd
            <register>
               <name>SMPR2</name>
               <displayName>SMPR2</displayName>
               <description>ADC sampling time register 2</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMP18</name>
                     <description>ADC channel 18 sampling time               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP17</name>
                     <description>ADC channel 17 sampling time               selection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP16</name>
                     <description>ADC channel 16 sampling time               selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP15</name>
                     <description>ADC channel 15 sampling time               selection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP14</name>
                     <description>ADC channel 14 sampling time               selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP13</name>
                     <description>ADC channel 13 sampling time               selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP12</name>
                     <description>ADC channel 12 sampling time               selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP11</name>
                     <description>ADC channel 11 sampling time               selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP10</name>
                     <description>ADC channel 10 sampling time               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TR1</name>
               <displayName>TR1</displayName>
               <description>ADC analog watchdog 1 threshold           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>HT1</name>
                     <description>ADC analog watchdog 1 threshold               high</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LT1</name>
                     <description>ADC analog watchdog 1 threshold               low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TR2</name>
               <displayName>TR2</displayName>
               <description>ADC analog watchdog 2 threshold           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>HT2</name>
                     <description>ADC analog watchdog 2 threshold               high</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LT2</name>
                     <description>ADC analog watchdog 2 threshold               low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TR3</name>
               <displayName>TR3</displayName>
               <description>ADC analog watchdog 3 threshold           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>HT3</name>
                     <description>ADC analog watchdog 3 threshold               high</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LT3</name>
                     <description>ADC analog watchdog 3 threshold               low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR1</name>
               <displayName>SQR1</displayName>
               <description>ADC group regular sequencer ranks register           1</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ4</name>
                     <description>ADC group regular sequencer rank               4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ3</name>
                     <description>ADC group regular sequencer rank               3</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ2</name>
                     <description>ADC group regular sequencer rank               2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ1</name>
                     <description>ADC group regular sequencer rank               1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>L3</name>
                     <description>L3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR2</name>
               <displayName>SQR2</displayName>
               <description>ADC group regular sequencer ranks register           2</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ9</name>
                     <description>ADC group regular sequencer rank               9</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ8</name>
                     <description>ADC group regular sequencer rank               8</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ7</name>
                     <description>ADC group regular sequencer rank               7</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ6</name>
                     <description>ADC group regular sequencer rank               6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ5</name>
                     <description>ADC group regular sequencer rank               5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR3</name>
               <displayName>SQR3</displayName>
               <description>ADC group regular sequencer ranks register           3</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ14</name>
                     <description>ADC group regular sequencer rank               14</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ13</name>
                     <description>ADC group regular sequencer rank               13</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ12</name>
                     <description>ADC group regular sequencer rank               12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ11</name>
                     <description>ADC group regular sequencer rank               11</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ10</name>
                     <description>ADC group regular sequencer rank               10</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR4</name>
               <displayName>SQR4</displayName>
               <description>ADC group regular sequencer ranks register           4</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ16</name>
                     <description>ADC group regular sequencer rank               16</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ15</name>
                     <description>ADC group regular sequencer rank               15</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>ADC group regular conversion data           register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDATA_0_6</name>
                     <description>Regular Data converted 0_6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDATA_7_15</name>
                     <description>15</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>JSQR</name>
               <displayName>JSQR</displayName>
               <description>ADC group injected sequencer           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JSQ4</name>
                     <description>ADC group injected sequencer rank               4</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JSQ3</name>
                     <description>ADC group injected sequencer rank               3</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JSQ2</name>
                     <description>ADC group injected sequencer rank               2</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JSQ1</name>
                     <description>ADC group injected sequencer rank               1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JEXTEN</name>
                     <description>ADC group injected external trigger               polarity</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>JEXTSEL</name>
                     <description>ADC group injected external trigger               source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>JL</name>
                     <description>ADC group injected sequencer scan               length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR1</name>
               <displayName>OFR1</displayName>
               <description>ADC offset number 1 register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET1_EN</name>
                     <description>ADC offset number 1 enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1_CH</name>
                     <description>ADC offset number 1 channel               selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1</name>
                     <description>ADC offset number 1 offset               level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR2</name>
               <displayName>OFR2</displayName>
               <description>ADC offset number 2 register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET2_EN</name>
                     <description>ADC offset number 2 enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET2_CH</name>
                     <description>ADC offset number 2 channel               selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET2</name>
                     <description>ADC offset number 2 offset               level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR3</name>
               <displayName>OFR3</displayName>
               <description>ADC offset number 3 register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET3_EN</name>
                     <description>ADC offset number 3 enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET3_CH</name>
                     <description>ADC offset number 3 channel               selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET3</name>
                     <description>ADC offset number 3 offset               level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR4</name>
               <displayName>OFR4</displayName>
               <description>ADC offset number 4 register</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET4_EN</name>
                     <description>ADC offset number 4 enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET4_CH</name>
                     <description>ADC offset number 4 channel               selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET4</name>
                     <description>ADC offset number 4 offset               level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR1</name>
               <displayName>JDR1</displayName>
               <description>ADC group injected sequencer rank 1           register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA1</name>
                     <description>ADC group injected sequencer rank 1               conversion data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR2</name>
               <displayName>JDR2</displayName>
               <description>ADC group injected sequencer rank 2           register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA2</name>
                     <description>ADC group injected sequencer rank 2               conversion data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR3</name>
               <displayName>JDR3</displayName>
               <description>ADC group injected sequencer rank 3           register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA3</name>
                     <description>ADC group injected sequencer rank 3               conversion data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR4</name>
               <displayName>JDR4</displayName>
               <description>ADC group injected sequencer rank 4           register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA4</name>
                     <description>ADC group injected sequencer rank 4               conversion data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
