cmsis-svd/cmsis-svd/data/STMicro/STM32WB35.svd
            <register>
               <name>VERR</name>
               <displayName>VERR</displayName>
               <description>IPCC version register</description>
               <addressOffset>0x3F4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>MAJREV</name>
                     <description>Major Revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MINREV</name>
                     <description>Minor Revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPIDR</name>
               <displayName>IPIDR</displayName>
               <description>IPCC indentification register</description>
               <addressOffset>0x3F8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00100071</resetValue>
               <fields>
                  <field>
                     <name>IPID</name>
                     <description>Identification Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIDR</name>
               <displayName>SIDR</displayName>
               <description>IPCC size indentification           register</description>
               <addressOffset>0x3FC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0xA3C5DD01</resetValue>
               <fields>
                  <field>
                     <name>SID</name>
                     <description>Size Identification Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>EXTI</name>
         <description>External interrupt/event       controller</description>
         <groupName>EXTI</groupName>
         <baseAddress>0x58000800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PVD</name>
            <description>PVD through EXTI[16] (C1IMR2[20])</description>
            <value>1</value>
         </interrupt>
         <interrupt>
            <name>EXTI0</name>
            <description>EXTI line 0 interrupt through
        EXTI[0]</description>
            <value>6</value>
         </interrupt>
         <interrupt>
            <name>EXTI1</name>
            <description>EXTI line 0 interrupt through
        EXTI[1]</description>
            <value>7</value>
         </interrupt>
         <interrupt>
            <name>EXTI2</name>
            <description>EXTI line 0 interrupt through
        EXTI[2]</description>
            <value>8</value>
         </interrupt>
         <interrupt>
            <name>EXTI3</name>
            <description>EXTI line 0 interrupt through
        EXTI[3]</description>
            <value>9</value>
         </interrupt>
         <interrupt>
            <name>EXTI4</name>
            <description>EXTI line 0 interrupt through
        EXTI[4]</description>
            <value>10</value>
         </interrupt>
         <interrupt>
            <name>C2SEV</name>
            <description>CPU2 SEV through EXTI[40]</description>
            <value>21</value>
         </interrupt>
         <interrupt>
            <name>EXTI5_9</name>
            <description>EXTI line [9:5] interrupt through
        EXTI[9:5]</description>
            <value>23</value>
         </interrupt>
         <interrupt>
            <name>EXTI10_15</name>
            <description>EXTI line [15:10] interrupt through
        EXTI[15:10]</description>
            <value>40</value>
         </interrupt>
         <registers>
            <register>
               <name>RTSR1</name>
               <displayName>RTSR1</displayName>
               <description>rising trigger selection           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RT</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
                  <field>
                     <name>RT_31</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FTSR1</name>
               <displayName>FTSR1</displayName>
               <description>falling trigger selection           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FT</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
                  <field>
                     <name>FT_31</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWIER1</name>
               <displayName>SWIER1</displayName>
               <description>software interrupt event           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWI</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
                  <field>
                     <name>SWI_31</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PR1</name>
               <displayName>PR1</displayName>
               <description>EXTI pending register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIF</name>
                     <description>Configurable event inputs Pending               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
                  <field>
                     <name>PIF_31</name>
                     <description>Configurable event inputs Pending               bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTSR2</name>
               <displayName>RTSR2</displayName>
               <description>rising trigger selection           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RT33</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RT40_41</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FTSR2</name>
               <displayName>FTSR2</displayName>
               <description>falling trigger selection           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FT33</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FT40_41</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWIER2</name>
               <displayName>SWIER2</displayName>
               <description>software interrupt event           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWI33</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWI40_41</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PR2</name>
               <displayName>PR2</displayName>
               <description>pending register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIF33</name>
                     <description>Configurable event inputs x+32 Pending               bit.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIF40_41</name>
                     <description>Configurable event inputs x+32 Pending               bit.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1IMR1</name>
               <displayName>C1IMR1</displayName>
               <description>CPUm wakeup with interrupt mask           register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7FC00000</resetValue>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>CPU(m) wakeup with interrupt Mask on               Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2IMR1</name>
               <displayName>C2IMR1</displayName>
               <description>CPUm wakeup with interrupt mask           register</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7FC00000</resetValue>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>CPU(m) wakeup with interrupt Mask on               Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1EMR1</name>
               <displayName>C1EMR1</displayName>
               <description>CPUm wakeup with event mask           register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EM0_15</name>
                     <description>CPU(m) Wakeup with event generation Mask               on Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>EM17_21</name>
                     <description>CPU(m) Wakeup with event generation Mask               on Event input</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2EMR1</name>
               <displayName>C2EMR1</displayName>
               <description>CPUm wakeup with event mask           register</description>
               <addressOffset>0xC4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EM0_15</name>
                     <description>CPU(m) Wakeup with event generation Mask               on Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>EM17_21</name>
                     <description>CPU(m) Wakeup with event generation Mask               on Event input</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1IMR2</name>
               <displayName>C1IMR2</displayName>
               <description>CPUm wakeup with interrupt mask           register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0001FCFD</resetValue>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2IMR2</name>
               <displayName>C2IMR2</displayName>
               <description>CPUm wakeup with interrupt mask           register</description>
               <addressOffset>0xD0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0001FCFD</resetValue>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1EMR2</name>
               <displayName>C1EMR2</displayName>
               <description>CPUm wakeup with event mask           register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EM</name>
                     <description>CPU(m) Wakeup with event generation Mask               on Event input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2EMR2</name>
               <displayName>C2EMR2</displayName>
               <description>CPUm wakeup with event mask           register</description>
               <addressOffset>0xD4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EM</name>
                     <description>CPU(m) Wakeup with event generation Mask               on Event input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR5</name>
               <displayName>HWCFGR5</displayName>
               <description>Hardware configuration           registers</description>
               <addressOffset>0x3E0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x003EFFFF</resetValue>
               <fields>
                  <field>
                     <name>CPUEVENT</name>
                     <description>HW configuration CPU event               generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR6</name>
               <displayName>HWCFGR6</displayName>
               <description>Hardware configuration           registers</description>
               <addressOffset>0x3DC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000300</resetValue>
               <fields>
                  <field>
                     <name>CPUEVENT</name>
                     <description>HW configuration CPU event               generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR7</name>
               <displayName>HWCFGR7</displayName>
               <description>EXTI Hardware configuration           registers</description>
               <addressOffset>0x3D8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CPUEVENT</name>
                     <description>HW configuration CPU event               generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR2</name>
               <displayName>HWCFGR2</displayName>
               <description>Hardware configuration           registers</description>
               <addressOffset>0x3EC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x803FFFFF</resetValue>
               <fields>
                  <field>
                     <name>EVENT_TRG</name>
                     <description>HW configuration event trigger               type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR3</name>
               <displayName>HWCFGR3</displayName>
               <description>Hardware configuration           registers</description>
               <addressOffset>0x3E8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000302</resetValue>
               <fields>
                  <field>
                     <name>EVENT_TRG</name>
                     <description>HW configuration event trigger               type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR4</name>
               <displayName>HWCFGR4</displayName>
               <description>Hardware configuration           registers</description>
               <addressOffset>0x3E4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVENT_TRG</name>
                     <description>HW configuration event trigger               type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
