cmsis-svd/cmsis-svd/data/STMicro/STM32WB35.svd
            <register>
               <name>ADDR6_RX</name>
               <displayName>ADDR6_RX</displayName>
               <description>Reception buffer address 0</description>
               <addressOffset>0x84</addressOffset>
               <size>0x10</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADDR6_RX</name>
                     <description>Reception buffer address</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR7_RX</name>
               <displayName>ADDR7_RX</displayName>
               <description>Reception buffer address 0</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x10</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADDR7_RX</name>
                     <description>Reception buffer address</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT0_RX</name>
               <displayName>COUNT0_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x56</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT0_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT1_RX</name>
               <displayName>COUNT1_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x5E</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT1_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT2_RX</name>
               <displayName>COUNT2_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x66</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT2_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT3_RX</name>
               <displayName>COUNT3_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x6E</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT3_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT4_RX</name>
               <displayName>COUNT4_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x76</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT4_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT5_RX</name>
               <displayName>COUNT5_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x7E</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT5_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT6_RX</name>
               <displayName>COUNT6_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x86</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT6_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT7_RX</name>
               <displayName>COUNT7_RX</displayName>
               <description>Reception byte count 0</description>
               <addressOffset>0x8E</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COUNT7_RX</name>
                     <description>Reception byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NUM_BLOCK</name>
                     <description>Number of blocks</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BL_SIZE</name>
                     <description>Block size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPMCSR</name>
               <displayName>LPMCSR</displayName>
               <description>control and status register</description>
               <alternateRegister>ADDR0_RX</alternateRegister>
               <addressOffset>0x54</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>LPMEN</name>
                     <description>LPM support enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMACK</name>
                     <description>LPM Token acknowledge               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>REMWAKE</name>
                     <description>RemoteWake value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BESL</name>
                     <description>BESL value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCDR</name>
               <displayName>BCDR</displayName>
               <description>Battery charging detector(</description>
               <addressOffset>0x58</addressOffset>
               <size>0x10</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>BCDEN</name>
                     <description>Battery charging detector (BCD)               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DCDEN</name>
                     <description>Data contact detection (DCD) mode               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PDEN</name>
                     <description>Primary detection (PD) mode               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SDEN</name>
                     <description>Secondary detection (SD) mode               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DCDET</name>
                     <description>Data contact detection (DCD)               status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PDET</name>
                     <description>Primary detection (PD)               status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SDET</name>
                     <description>Secondary detection (SD)               status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PS2DET</name>
                     <description>DM pull-up detection               status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DPPU</name>
                     <description>DP pull-up control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
